In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan,1,1,1],
                  'B':[5,np.nan,np.nan,2,2,2],
                  'C':[1,2,3,1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [4]:
df.isna()  #NAN = True , not NAN = False

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False  False
4  False  False  False
5  False  False  False

In [5]:
df.isna().any()

A     True
B     True
C    False
dtype: bool

In [6]:
df.isna().any().count() # Total number of null values avialable in Dataset

3

In [7]:
df.isna().sum()  # sum of null values in each coloumn

A    1
B    2
C    0
dtype: int64

In [9]:
df[df['A'].isnull()].index.tolist()  #index means position at which null is

[2]

In [11]:
df[df['A'].isnull()]

    A   B  C
2 NaN NaN  3

In [12]:
df[df['B'].isnull()].index.tolist()

[1, 2]

In [13]:
# remove such row which havinng NULL/NAN value
# bydefault it will drop from the row

df1=df.dropna()
df1

     A    B  C
0  1.0  5.0  1
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [15]:
df1 #views

     A    B  C
0  1.0  5.0  1
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [16]:
df.dropna(axis = 1) # drop the coloumn who's having NULL/NAN

   C
0  1
1  2
2  3
3  1
4  2
5  3

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [18]:
df.dropna(thresh=2) # min no. of non NAN/NULL you need = 2
#   thresh = is allowing that many non NA values. (NON NA 2 and more then)
# drop all such rows which have less than 2 non NA values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [19]:
df.dropna(thresh=1,axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [20]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [23]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [24]:
df.fillna(value="UTKARSH 2222")

              A             B  C
0             1             5  1
1             2  UTKARSH 2222  2
2  UTKARSH 2222  UTKARSH 2222  3
3             1             2  1
4             1             2  2
5             1             2  3

In [25]:
df.fillna(axis=1,value='Fill 2222')

           A          B  C
0          1          5  1
1          2  Fill 2222  2
2  Fill 2222  Fill 2222  3
3          1          2  1
4          1          2  2
5          1          2  3

In [26]:
df['A'].fillna(value='22')

0     1
1     2
2    22
3     1
4     1
5     1
Name: A, dtype: object

In [27]:
df['A']

0    1.0
1    2.0
2    NaN
3    1.0
4    1.0
5    1.0
Name: A, dtype: float64

In [28]:
# taking mean
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.2
3    1.0
4    1.0
5    1.0
Name: A, dtype: float64

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [30]:
# fill mean for entire datasets
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.2  2
2  1.2  1.2  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3

In [34]:
df.describe()

              A     B         C
count  5.000000  4.00  6.000000
mean   1.200000  2.75  2.000000
std    0.447214  1.50  0.894427
min    1.000000  2.00  1.000000
25%    1.000000  2.00  1.250000
50%    1.000000  2.00  2.000000
75%    1.000000  2.75  2.750000
max    2.000000  5.00  3.000000

In [35]:
df.fillna(df['A'].mode()[0])

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3
3  1.0  2.0  1
4  1.0  2.0  2
5  1.0  2.0  3